In [145]:
import os
import csv
import pandas as pd

In [146]:
file_data = pd.read_csv("Resources/purchase_data.csv")
file_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [147]:
file_data = "Resources/purchase_data.csv"
file_data = pd.read_csv(file_data)
file_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [148]:
# Total Number of Players

player_count = len(file_data["SN"].value_counts())

Table = pd.DataFrame({"Total Players": [player_count]})
Table

   Total Players
0            576

In [149]:
# Purchasing Analysis Total

unique_items = len(file_data["Item Name"].value_counts())

avg_price = round(file_data["Price"].mean(),2)
total_purchase = len(file_data["Purchase ID"].value_counts())
total_revenue = file_data["Price"].sum()


table_pa = pd.DataFrame({"Number of Unique Items": [unique_items], "Average Price": [avg_price],
                        "Number of Purchases": [total_purchase], "Total Revenue": [total_revenue]})

table_pa

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179           3.05                  780        2379.77

In [150]:
# Gender Demographics

player_gender = file_data.loc[:, ["SN", "Gender"]]
player_gender.head

player_gender = player_gender.drop_duplicates()
player_gender.head

player_total = player_gender["Gender"].value_counts()
player_total

percent_gender = round((player_total / player_count * 100),2)
percent_gender

table_gd = pd.DataFrame({"Total Count": player_total, "Percentage of Players": percent_gender})
table_gd

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [151]:
# Purchasing Analysis By Gender


avg_purchase_price = round(file_data.groupby(['Gender']).mean()['Price'],2)
avg_purchase_price

total_purchase_gender = round(file_data.groupby(['Gender']).sum()['Price'],2)
total_purchase_gender


table_pa1 = pd.DataFrame({"Purchase Count": player_total, "Average Purchase Price": avg_purchase_price, 
                         "Total Purchase": total_purchase_gender})
table_pa1

                       Purchase Count  Average Purchase Price  Total Purchase
Female                             81                    3.20          361.94
Male                              484                    3.02         1967.64
Other / Non-Disclosed              11                    3.35           50.19

In [152]:
# Age Demographics // creating bins and adding new column to existing data frame

bins = [10,15, 19, 20, 25, 30, 35, 40, 45, 50]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40-44", "45+"]

pd.cut(file_data["Age"], bins, labels=group_names).head()

file_data["Age Group"] = pd.cut(file_data["Age"], bins, labels=group_names)
file_data.head()
file_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [153]:
# Counting the number of people in each group
count_age = file_data["Age Group"].value_counts()
count_age

20-24    325
10-14    101
15-19     99
25-29     77
<10       54
30-34     52
35-39     33
40-44      7
45+        0
Name: Age Group, dtype: int64

In [154]:
# avg price in each age group

age_data_group = file_data.groupby("Age Group").mean()['Price']
age_data_group

Age Group
<10      2.900000
10-14    3.041980
15-19    3.174949
20-24    3.020431
25-29    2.875584
30-34    2.994423
35-39    3.404545
40-44    3.075714
45+           NaN
Name: Price, dtype: float64

In [155]:
# total purchase by each age group

age_data_sum = file_data.groupby("Age Group").sum()['Price']
age_data_sum

Age Group
<10      156.60
10-14    307.24
15-19    314.32
20-24    981.64
25-29    221.42
30-34    155.71
35-39    112.35
40-44     21.53
45+        0.00
Name: Price, dtype: float64

In [156]:
# Average purchase total per person by age group

avg_person_age = age_data_group / count_age
avg_person_age

<10      0.053704
10-14    0.030119
15-19    0.032070
20-24    0.009294
25-29    0.037345
30-34    0.057585
35-39    0.103168
40-44    0.439388
45+           NaN
dtype: float64

In [157]:
# Creating a dataframe to dsiplay age demographics

table_ad = pd.DataFrame({"Total Count": count_age, "Average Purchase Price": age_data_group, 
                        "Total Purchase": age_data_sum, "Average Per Person By Age Group": avg_person_age})
table_ad

,Total Count,Average Purchase Price,Total Purchase,Average Per Person By Age Group
<10,54,2.900000,156.60,0.053704
10-14,101,3.041980,307.24,0.030119
15-19,99,3.174949,314.32,0.032070
20-24,325,3.020431,981.64,0.009294
25-29,77,2.875584,221.42,0.037345
30-34,52,2.994423,155.71,0.057585
35-39,33,3.404545,112.35,0.103168
40-44,7,3.075714,21.53,0.439388
45+,0,NaN,0.00,NaN

In [158]:
top_spenders = file_data.groupby(['SN']).sum()['Price']
top_spenders

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [159]:
# Counting No of Purchases made by top 5

count_spender = file_data.groupby(['SN']).count()['Price']
count_spender

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [160]:
# Average pf Top Spenders

avg_spender = file_data.groupby(['SN']).mean()['Price']
avg_spender

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [161]:
# Creating A DataFrame to make table

table_ts = pd.DataFrame({"Purchase Count": count_spender, "Average Purchase Price": avg_spender, 
                        "Total Purchase Value": top_spenders})
table_ts.sort_values("Total Purchase Value", ascending=False).head(5).round(2)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

In [162]:
# Most Popular Items

In [163]:
# By Item ID

item_id = file_data.groupby(['Item ID', 'Item Name']).count()['Price']
item_id

Item ID  Item Name
0        Splinter                           4
1        Crucifer                           3
2        Verdict                            6
3        Phantomlight                       6
4        Bloodlord's Fetish                 5
                                           ..
179      Wolf, Promise of the Moonwalker    6
180      Stormcaller                        1
181      Reaper's Toll                      5
182      Toothpick                          3
183      Dragon's Greatsword                3
Name: Price, Length: 183, dtype: int64

In [167]:
# By Item Price

item_price = file_data.groupby(['Item ID', 'Item Name']).mean()['Price']
item_price

Item ID  Item Name
0        Splinter                           1.28
1        Crucifer                           3.26
2        Verdict                            2.48
3        Phantomlight                       2.49
4        Bloodlord's Fetish                 1.70
                                            ...
179      Wolf, Promise of the Moonwalker    4.48
180      Stormcaller                        3.36
181      Reaper's Toll                      1.66
182      Toothpick                          4.03
183      Dragon's Greatsword                1.09
Name: Price, Length: 183, dtype: float64

In [165]:
total_purchase_value = file_data.groupby(['Item ID', 'Item Name']).sum()['Price']
total_purchase_value

Item ID  Item Name
0        Splinter                            5.12
1        Crucifer                            9.78
2        Verdict                            14.88
3        Phantomlight                       14.94
4        Bloodlord's Fetish                  8.50
                                            ...
179      Wolf, Promise of the Moonwalker    26.88
180      Stormcaller                         3.36
181      Reaper's Toll                       8.30
182      Toothpick                          12.09
183      Dragon's Greatsword                 3.27
Name: Price, Length: 183, dtype: float64

In [169]:
table_pi = pd.DataFrame({"Purchase Count": item_id, "Item Price": item_price, 
                         "Total Purchase Value": total_purchase_value})
table_pi.sort_values("Purchase Count",ascending=False).head(5).round(2)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [ ]:
## Most Profitable Items

In [174]:
item_profit = file_data.groupby(['Item ID', 'Item Name']).count()['Price']
item_profit

Item ID  Item Name
0        Splinter                           4
1        Crucifer                           3
2        Verdict                            6
3        Phantomlight                       6
4        Bloodlord's Fetish                 5
                                           ..
179      Wolf, Promise of the Moonwalker    6
180      Stormcaller                        1
181      Reaper's Toll                      5
182      Toothpick                          3
183      Dragon's Greatsword                3
Name: Price, Length: 183, dtype: int64

In [172]:
item_price_profit = file_data.groupby(['Item ID', 'Item Name']).mean()['Price']
item_price_profit

Item ID  Item Name
0        Splinter                           1.28
1        Crucifer                           3.26
2        Verdict                            2.48
3        Phantomlight                       2.49
4        Bloodlord's Fetish                 1.70
                                            ...
179      Wolf, Promise of the Moonwalker    4.48
180      Stormcaller                        3.36
181      Reaper's Toll                      1.66
182      Toothpick                          4.03
183      Dragon's Greatsword                1.09
Name: Price, Length: 183, dtype: float64

In [173]:
total_purchase_profit = file_data.groupby(['Item ID', 'Item Name']).sum()['Price']
total_purchase_profit

Item ID  Item Name
0        Splinter                            5.12
1        Crucifer                            9.78
2        Verdict                            14.88
3        Phantomlight                       14.94
4        Bloodlord's Fetish                  8.50
                                            ...
179      Wolf, Promise of the Moonwalker    26.88
180      Stormcaller                         3.36
181      Reaper's Toll                       8.30
182      Toothpick                          12.09
183      Dragon's Greatsword                 3.27
Name: Price, Length: 183, dtype: float64

In [175]:
table_pi1 = pd.DataFrame({"Purchase Count": item_profit, "Item Price": item_price_profit, 
                         "Total Purchase Value": total_purchase_profit})
table_pi1.sort_values("Total Purchase Value",ascending=False).head(5).round(2)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80